package faang.school.notificationservice.service;

public class SmsService {
    // Задание
//    Создать Spring-компонент SmsService, который будет использоваться для отправки
//    SMS нотификаций пользователю на его номер телефона. Отправка SMS будет происходить через Vonage.
//    — это сервис телефонии с удобным и бесплатным пробным API. Нужно будет с ним интегрироваться.
//
//    Для этого нужно создать личный аккаунт на https://dashboard.nexmo.com/getting-started/sms
//    и разобраться с документацией интеграции на Java. Сконфигурировать всё необходимое согласно
//    документации в notification_service, а затем использовать созданные Vonage компоненты внутри нового SmsService.
//
//    SmsService должен реализовать интерфейс NotificationService, который уже предоставлен.
//    По сути, SmsService просто принимает сообщение и информацию о пользователе и отправляет
//    ему SMS через Vonage с переданным сообщением.
//
//    Критерии приема
//
//    1.Создана конфигурация Vonage в application.yaml на личный аккаунт.
//
//    2. Созданы все необходимые Spring-бины для работы с Vonage.
//
//    3.SMS действительно отправляется на тестовый номер (личный).
//
//    4. Написаны unit-тесты.
}
